![png](images/books_edr.png)

In [5]:
import pandas as pd
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

## Change username and password to match your personal MySQL Server settings
username = 'root' # default username for MySQL db is root
password = 'Ao9!#Gt8' # whatever password you chose during MySQL installation.

connection = f'mysql+pymysql://{username}:{password}@localhost/Book_db'
engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/Book_db)

In [8]:
q = '''SELECT * FROM authors;'''
pd.read_sql(q, engine)

   id       authors_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [9]:
q = '''SELECT * FROM books;'''
pd.read_sql(q, engine)

   id                 title author_id
0   1           The Shining         1
1   2                    It         1
2   3      The Great Gatsby         2
3   4  The Call of the Wild         3
4   5   Pride and Prejudice         4
5   6          Frankenstein         5

In [12]:
q = '''SELECT 
    *
FROM
    favorites;'''
pd.read_sql(q, engine)

   user_id  book_id
0        1        3
1        2        5
2        3        2
3        4        6
4        6        5
5        9        4
6       15       12

In [13]:
q = '''SELECT 
    *
FROM
    user;'''
pd.read_sql(q, engine)

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

### Testing the Database
After creating your 4 tables, you should run the "SHOW TABLES;" query in your notebook.

As a final step to this task, write a query at the end of your Jupyter Notebook to list the titles of all of John Doe's favorite books.  An example of the SQL syntax: Note this will depend on how you named your tables.

In [14]:
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_book_db
0           authors
1             books
2         favorites
3              user

In [15]:
q = '''SELECT 
    books.title, favorites.user_id
FROM
    books
        JOIN
    favorites ON books.id = favorites.book_id
WHERE
    favorites.user_id = (SELECT 
            user.id
        FROM
            user
        WHERE
            (user.last_name = 'Doe'
                AND user.first_name = 'John'));'''
pd.read_sql(q, engine)

              title  user_id
0  The Great Gatsby        1